# =========================
# Этап сборки (build stage)
# =========================
FROM golang:1.23 as build  # Используем официальный образ Go 1.23
WORKDIR /app               # Устанавливаем рабочую директорию внутри контейнера
COPY . .                   # Копируем все файлы проекта в контейнер
RUN go build -o server ./cmd/server  # Собираем бинарник сервера из папки cmd/server

# =========================
# Финальный минимальный образ (production stage)
# =========================
FROM debian:bookworm-slim   # Используем минимальный Debian для финального образа
WORKDIR /app                # Рабочая директория
COPY --from=build /app/server .  # Копируем собранный бинарник из build stage
COPY web ./web              # Копируем фронтенд (HTML/JS/CSS) в контейнер
CMD ["./server"]            # Команда по умолчанию: запускаем бинарник сервера
